# DefaultConstructionMassFloor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DefaultConstructionMassFloor Property
ParameterTypeId Class See Also
---
"Mass Floor"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DefaultConstructionMassFloor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DefaultConstructionMassFloor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DefaultConstructionMassFloor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace